Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནི་ཉིན་ལས་གྲིབ་མར་རམ།
en: He neither moved from the sun to the shade,

source: །གྲིབ་ལས་ཉི་མར་སོང་མ་བྱས།
en: Nor from the shade to the sun.

source: །ལྷུན་པོ་ལྟ་བུར་མི་གཡོ་བའི།
en: Immutable like the central mountain,

source: །རླུང་དང་ཆར་དང་ཤ་སྦྲང་དང་། །སྡིག་སྤྲུལ་སྦྲང་བུ་སྐྱོབ་མི་བྱེད།
en: He did not protect himself against the wind and the rain, Nor mosquitoes, poisonous snakes, or bees.

source: །རྣམ་པར་མ་འཁྲུགས་སྤྱོད་པ་ཡིས།
en: With a completely undisturbed behavior,

source: །བདག་ཉིད་གཅིག་པུའི་དོན་གྱི་ཕྱིར།
en: Not merely for his own sake

source: །མཁའ་ཁྱབ་བསམ་གཏན་བྱེད་པ་མིན།
en: Did he practice the all-pervasive concentration.

source: །གཞན་དུ་སྙིང་རྗེ་སེམས་ཀྱིས་ནི།
en: With compassion for others,

source: །འཇིག་རྟེན་དོན་མང་ཆེད་དུ་བསྒོམ།
en: He practiced for their sake as well.

source: །གྲོང་གི་བྱིས་པ་བ་ལང་རྫི།
en: Yet village children and cow herders

source: །ཤིང་ཐུན་དག་དང་རྩྭ་ཐུན་དག།
en: And those who gather wood and grass

source: །དེ་ལ་རྡུལ་ཁྲོད་འདྲེ་སྙམ་སེམས།
en: Thought that he was a demon made of dust

source: །དེ་ལ་ས་ཡིས་སྐུད་བྱེད་ཅིང་།
en: And covered him in soil.

source: །མི་གཙང་བ་ཡང་འཐོར་བར་བྱེད།
en: They even covered him with impure substances

source: །དེ་དག་གནོད་པ་མང་བྱེད་ཀྱང་།
en: And harmed him in many ways.

source: །གཡོ་བ་མེད་ཅིང་འཁྲུགས་མེད་པར།
en: Yet immovable and calm,

source: །མཐོ་བ་མེད་ཅིང་དམའ་བ་མེད།
en: Neither getting up nor lying down,

source: །ལུས་མ་བསྲུངས་པར་ཆོས་མ་རེག །
en: He did nothing to protect his body.

source: བཤང་བ་མི་བྱེད་གཅི་མི་བྱེད།
en: He did not defecate nor did he urinate;

source: །སྒྲ་ཡིས་མི་འཇིགས་གཞན་མི་ལྟ།
en: When sounds were heard, he was neither startled, nor did he avert his gaze.

source: །ཤ་དང་ཁྲག་རྣམས་སྐམས་གྱུར་ཏེ། །ལགས་པ་རྩ་རྒྱུས་རུས་པ་ལུས།
en: His flesh and blood dried out So that the bones and tendons stuck out through his skin.

source: །སྒལ་ཚིགས་དག་ནི་ལྟོ་བར་སྣང་།
en: His spine could be seen through his belly,

source: །ལན་བུ་བླས་པ་ཅི་བཞིན་ནོ།
en: Twisted like braided hair.

source: །གང་དག་ལྷག་པར་བྱས་ལྷ་དང་། །ལྷ་མིན་གནོད་སྦྱིན་དྲི་ཟ་ཀླུ། །ཡོན་ཏན་ལྡན་པ་མངོན་སུམ་བས། །ཉིན་དང་མཚན་དུ་མཆོད་པ་བྱེད།
en: The gods, demigods, yakṣas, gandharvas, and nāgas Who supported him, Made offerings to him day and night Because of seeing his qualities.

source: །ཇི་ལྟར་མཁའ་འདྲའི་སེམས་ལྡན་འདི།
en: Since his mind is like the sky,

source: །དེ་འདྲར་བདག་ཅག་མྱུར་གྱུར་ཅེས།
en: “May we also quickly be like him!”

source: །སྨོན་ལམ་དག་ཀྱང་འདེབས་པར་བྱེད།
en: Such aspirations did they make.

source: །སྙིང་རྗེའི་བློ་ཡིས་འཇིག་རྟེན་གྱི། །དོན་མང་ཕྱིར་བྱེད་མ་གཏོགས་པར།
en: Motivated by compassion for others, He sought to bring about vast benefits to the world.

source: །བདག་ཕྱིར་མ་ཡིན་བདེ་བློས་མིན།
en: He did not practice for himself,

source: །བསམ་གཏན་རོ་ནི་མྱང་ཕྱིར་མིན། །ཕས་ཀྱི་རྒོལ་བ་རབ་ཏུ་བཅོམ། །མུ་སྟེགས་བློ་ཉམས་ཟིལ་གྱིས་མནན། །མགོ་རེག་བྱང་ཆུབ་ག་ལ་ཡོད།
en: Neither for pleasure nor to feel the taste of absorption. He overcame his opponents’ attacks; He outshone the feeble minds of extremists. The actions and deeds that were described by Kāśyapa Were now being demonstrated.

source: །བྱང་ཆུབ་བསྐལ་མང་རྙེད་དཀའ་ཞེས། །འོད་སྲུང་ལ་ནི་ཚིག་སྨྲས་པའི། །ལས་དང་བྱ་བ་རབ་ཏུ་བསྟན།
en: This awakening was the same as the awakening of Krakucchanda; It is difficult to find even over many eons.

source: །སྐྱེ་བོ་དག་ནི་དགའ་བྱའི་ཕྱིར།
en: In order to bring benefit to mankind,

source: །ལྷ་མི་ཁྲག་ཁྲིག་བཅུ་གཉིས་ཚང་།
en: There are one thousand two hundred billion gods and humans

source: །ཐེག་པ་གསུམ་ལ་རབ་ཏུ་བཏུལ།
en: That are guided in the Three Vehicles.

source: །དེ་ཡི་ཆེད་དུ་བློ་གྲོས་བཟང་།
en: It is for their sake that the One with Excellent Intellect

source: །དཀའ་བ་སྤྱད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། བཅུ་བདུན་པའོ།། །།
en: This concludes the seventeenth chapter, on practicing austerities.

source: དགེ་སློང་དག་བདུད་སྡིག་ཅན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཕྱི་བཞིན་འབྲང་སྟེ།
en: Monks, during the six years that the Bodhisattva practiced austerities, he was continually followed by Māra, the evil one.

source: གླགས་བལྟས་སྐབས་བཙལ་ཀྱང་ནམ་ཡང་གླགས་ཅུང་ཟད་ཀྱང་མ་རྙེད་དོ།
en: Yet, although Māra tried his best to harm the Bodhisattva, he never found an opportunity.

source: །དེ་གླགས་མ་རྙེད་ནས་ཡི་ཆད་དེ་ཡིད་ལ་གཅགས་བཞིན་དུ་སོང་ངོ་།
en: As it became apparent that it would be impossible to harm the Bodhisattva, Māra, sad and dejected, finally left.

source: དགོན་པ་ཉམས་ནི་དགའ་བ་དང་། །ནགས་ཚལ་གེལ་པ་སྒྲ་མེད་དང་། །ལྟེང་རྒྱས་ཀྱི་ནི་ཤར་ཕྱོགས་ན།
en: There is a pleasant wilderness With forest thickets full of herbs To the east of Urubilvā,

source: །ཆུ་ཀླུང་ནཻ་རན་ཛ་ན་དེར།
en: Where the Nairañjanā River flows.

source: །སྤོང་བའི་ཕྱིར་ནི་བརྩོན་པར་བྱས།
en: There, for the sake of renunciation,

source: །རྟག་ཏུ་མཐུ་རྩལ་བརྟན་པ་པོ།
en: The Bodhisattva persevered with continuous and stable strength.

source: །གྲུབ་དང་བདེ་བ་ཐོབ་བྱའི་ཕྱིར། །བརྩོན་པས་རབ་ཏུ་རྟུལ་དེ་ལ།
en: To attain accomplishment and bliss, He remained calm and diligent.

source: །བདུད་ནི་འཇམ་ཞིང་སྙན་པའི་ཚིག །སྨྲ་བར་བྱེད་ཅིང་འོངས་པར་གྱུར།
en: Māra approached him and said, With soft and pleasant words,

source: །ཀྱེ་སྲོག་གཅེས་ཀྱིས་འཚོ་བར་གྱིས། །གསོན་ན་ཆོས་ནི་སྤྱོད་པར་འགྱུར།
en: “O Son of the Śākyas, get up! What use is there in tormenting your body? “Life is better for the living; Alive, you can practice the Dharma.

source: །གསོན་ཚེ་བྱ་བ་གང་ཡོད་པ།
en: As a living being, you can do that,

source: །དེ་དག་བྱས་ན་མྱ་ངན་མེད།
en: Then later you will have no regrets.

source: །ཁྱོད་ནི་མདོག་ཉམས་དམན་པར་གྱུར།
en: “But your complexion has faded and is almost gone,

source: །ཁྱོད་ནི་ཤི་ལ་ཐུག་ཅིང་འདུག །འཆི་བའི་ཆ་ནི་སྟོང་སྙེད་ཙམ།
en: And it appears as though you’re on the verge of dying. Death has a thousand chances,

source: །ཆ་གཅིག་ཙམ་ཅིག་གསོན་པར་ཟད།
en: While life has only one.

source: །སྦྱིན་པ་དག་ནི་རྟག་ཏུ་བྱིན།
en: “One who always gives

source: །མེ་ཡི་སྦྱིན་སྲེག་སྦྱིན་སྲེག་བྱོས།
en: And performs fire offerings

source: །འོན་ཀྱང་བསོད་ནམས་ཆེན་པོར་འགྱུར།
en: Will accumulate great merit.

source: །སྤོང་བ་ཡིས་ནི་ཅི་ཞིག་བྱ།
en: Why then do you practice renunciation?

source: །སྤོང་བའི་ལམ་ནི་སྡུག་བསྔལ་ཏེ།
en: “The path of renunciation brings only suffering

source: །སེམས་དུལ་བ་ནི་བྱ་དཀའ་ཞེས།
en: And taming the mind is hard.”

source: །དེ་ཚེ་བདུད་ཀྱིས་དེ་སྐད་ཚིག །བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་སྨྲས།
en: This is what Māra said When addressing the Bodhisattva.

source: །དེ་སྐད་སྨྲ་བའི་བདུད་དེ་ལ།
en: To reply to Māra who said these words,

source: །བྱང་ཆུབ་སེམས་དཔས་འདི་སྐད་སྨྲས།
en: The Bodhisattva said,

source: །སྡིག་ཅན་མྱོས་པའི་རྩ་ལག་པོ།
en: “Evil one, steeped in craziness!

source: །ཁྱོད་ནི་རང་གི་དོན་ཕྱིར་འོངས།
en: You have come here with ulterior motives.

source: །ང་ལ་བསོད་ནམས་ཆུད་ཟད་ཀྱང་། །དོན་དུ་གཉེར་བ་མེད་དོ་བདུད།
en: “For you have no intent That would match my merits, Māra.

source: །གང་དག་བསོད་ནམས་དོན་དུ་གཉེར།
en: If you were interested in merit,

source: །དེ་ལ་དེ་སྐད་སྨྲ་བའི་རིགས།
en: You would rather speak like this:

source: །འཚོ་བའི་མཐའ་ནི་འཆི་ཡིན་པས།
en: “ ‘Since the end of life is death,

source: །མི་འཆི་སྙམ་དུ་ང་མི་སེམས།
en: I do not concern myself with death.

source: །ཚངས་པར་སྤྱོད་ལ་གཞོལ་གྱུར་པས།
en: Wholly devoted to my religious practice,

source: །ཕྱིར་ལྡོག་པར་ནི་མི་བྱའོ།
en: I shall never back down.

source: །ཆུ་ཀླུང་དག་གི་ཆུ་རྒྱུན་ཀྱང་།
en: “ ‘If even the flow of rivers

source: །རླུང་གིས་རྣམ་པར་སྐེམས་བྱེད་ན།
en: Can be dried out by the wind,

source: །སྤངས་པ་ཉིད་ཀྱི་ཁྲག་ཙམ་ལྟ།
en: Then what about the body and blood of the renunciant?

source: །འདི་ཡིས་ཅི་ཕྱིར་སྐམས་མི་འགྱུར།
en: Wouldn’t that be dried out as well?

source: །ཁྲག་ནི་སྐམས་པར་གྱུར་པ་དང་། །དེ་ཡི་འོག་ཏུ་ཤ་སྐམས་འགྱུར།
en: “ ‘When his blood has dried out, his flesh will wither.

source: །ཤ་ནི་ཟད་པར་གྱུར་པ་དང་། །ཕྱིར་ཞིང་སེམས་ནི་དང་བར་འགྱུར།
en: When his flesh has wasted away, His mind will become yet clearer.

source: །ཕྱིར་ཞིང་འདུན་དང་བརྩོན་འགྲུས་དང་། །ཏིང་ངེ་འཛིན་ཀྱང་གནས་པར་འགྱུར།
en: He will have more dedication, diligence, and absorption.’

source: །ང་ནི་དེ་ལྟར་གནས་པས་ན།
en: “Since I live like that,

source: །ཚོར་བ་དམ་པ་ཐོབ་གྱུར་ཀྱང་།
en: I have attained the highest perception,

source: །ལུས་དང་སྲོག་ལ་མི་ལྟ་སྟེ།
en: So I do not worry about my body and my life.

source: །སྲན་ཐུབ་དག་པར་གྱུར་ལ་ལྟོས།
en: Just look at the purity of my being.

source: །ང་ལ་འདུན་པ་ཡོད་གྱུར་ཅིང་། །བརྩོན་འགྲུས་དང་ནི་ཤེས་རབ་ཡོད། །
en: “I am dedicated and diligent; I have insight as well.

source: ང་ཡི་བརྩོན་འགྲུས་བསྐྱོད་ནུས་པ། །འཇིག་རྟེན་དེ་ནི་ངས་མ་མཐོང་།
en: In this world I see no one Capable of disturbing my diligence.

source: །སྲོག་ཆད་ཤི་བ་ཆེས་བླ་སྟེ།
en: “Better is death, the thief of the life force,

source: །འཚོ་བ་ངན་པ་དེ་ལྟ་མིན།
en: Than living an unwholesome life.

source: །གཡུལ་ངོར་ཤི་བ་ལེགས་པ་སྟེ།
en: It is better to die in battle

source: །ཕམ་ནས་གསོན་པ་དེ་ལྟ་མིན།
en: Than live defeated by the enemy.

source: །སྡར་མ་དཔུང་ལས་མི་རྒྱལ་ཏེ། །དཔའ་བོ་དཔུང་ལས་རྒྱལ་བར་འགྱུར། །རྒྱལ་ཡང་དེ་ནི་རློམ་སེམས་མེད།
en: “A coward cannot defeat an army; Armies conquer and win respect. Yet a hero can defeat an army;

source: །བདུད་ཁྱོད་ལས་ནི་མྱུར་རྒྱལ་བྱ།
en: O Māra, I will easily defeat you.

source: །འདོད་པ་ཁྱོད་ཀྱི་དང་པོའི་དཔུང་།
en: “Desire is your foremost army;

source: །མི་དགའ་བ་ནི་གཉིས་པ་ཡིན།
en: Discontent comes next.

source: །ཁྱོད་ཀྱི་གསུམ་པ་བཀྲེས་དང་སྐོམ།
en: Third is hunger and thirst;

source: །སྲེད་པ་དཔུང་ཚོགས་བཞི་པ་ཡིན།
en: Craving is your fourth army.

source: །རྨུགས་དང་གཉིད་ནི་ལྔ་པ་སྟེ།
en: “Fifth is dullness and stupor;

source: །འཇིགས་པ་དྲུག་པར་བརྗོད་པ་ཡིན།
en: Fear is said to be sixth.

source: །ཁྱོད་ཀྱི་ཐེ་ཚོམ་བདུན་པ་སྟེ།
en: Your doubt is army number seven;

source: །ཁྲོ་དང་འཆབ་པ་བརྒྱད་པ་ཡིན།
en: Anger and hypocrisy come eighth.

source: །འཐོབ་དང་ཚིགས་བཅད་བཀུར་སྟི་དང་། །ལོག་པར་གྲགས་པ་གང་ཐོབ་དང་། །བདག་ལ་སྟོད་པར་བྱེད་པ་དང་། །གཞན་ལ་སྨོད་པར་བྱེད་པ་དང་། །དེ་དག་ནག་པོའི་རྩ་ལག་ཏུ། །ལྷུང་བའི་བདུད་ཀྱི་དཔུང་ཡིན་ནོ།
en: “Ambition, greed, and wanting praise, Fame obtained through deception, Seeking to exalt oneself And put down others: “This is the army of Māra, The evil friend who inflicts torment.

source: །དགེ་སྦྱོང་བྲམ་ཟེ་ཁ་ཅིག་ནི།
en: Some ascetics and priests

source: །འདི་ན་གླགས་ལྟ་འཁོད་པར་སྣང་།
en: Appear to be caught up in that.

source: །ཁྱོད་དཔུང་གང་ཡིན་ལྷར་བཅས་ཀྱིས།
en: “This army of yours,

source: །འཇིག་རྟེན་འདི་ནི་རབ་འདུལ་བ། །སོ་བཏང་མ་བྱས་སྣོད་ཆུས་བཞིན། །ཤེས་རབ་ཀྱིས་ནི་དེ་དག་གཞིག
en: Which overcomes this world and that of the gods, I will destroy it with knowledge, Just as water destroys a vessel of unbaked clay.

source: །དྲན་པ་ལེགས་པར་ཉེར་བཞག་སྟེ།
en: “With mindfulness as the foundation

source: །ཤེས་རབ་ལེགས་པར་བསྒོམས་བྱས་ནས།
en: And knowledge as my training,

source: །ཤེས་བཞིན་དུ་ནི་སྤྱོད་པར་བྱ།
en: I act carefully.

source: །བློ་ངན་ཁྱོད་ཀྱིས་ཅི་བྱར་ཡོད།
en: So what will you now do, O feeble-minded one?”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་སྟེ། ཡི་མ་རངས་ནས་ཡིད་ལ་གཅགས་བཞིན་དུ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།།
en: As the Bodhisattva spoke these words, Māra, the evil one, felt very uncomfortable and sad. Having lost his confidence, he disappeared.

source: དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་ཁ་ཅིག་འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་དུས་ན་བདག་ལ་གནོད་པ་བྱེད་པ་དང་། ལུས་ལ་གདུང་བ་བྱེད་དེ། སྡུག་བསྔལ་དྲག་པོ་ཚ་བ་མི་བཟད་པ། ཡིད་དུ་མི་འོང་བའི་ཚོར་བ་མྱོང་བར་བྱེད་པས་དེ་དག་ཤིན་ཏུ་སྡུག་བསྔལ་བ་མྱོང་ངོ་སྙམ་མོ།
en: Monks, at that point the Bodhisattva thought to himself, “There are monks and priests in the past, the future, and the present who cause themselves harm. They experience intense suffering from unbearable heat and go through very unpleasant experiences. In this way they suffer greatly.”

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། སྤྱོད་པ་འདི་དང་བསྒྲུབ་པ་འདིས་མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ།
en: Monks, I continued to think, “With these acts and methods I have not been able to manifest any true knowledge that would be higher than manmade teachings.

source: འཕགས་པ་ཡེ་ཤེས་མཐོང་བའི་ཁྱད་པར་གང་ཡང་མངོན་དུ་མ་བྱས་ཏེ་འདི་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན།
en: This path does not lead to awakening.

source: ལམ་འདི་ནི་མ་འོངས་པའི་སྐྱེ་བ་དང་། རྒ་བ་དང་འཆི་བ་འབྱུང་བ་ནུབ་པར་བྱེད་པ་མ་ཡིན་ཏེ།
en: This path is incapable of eradicating the continuation of birth, old age, and death in the future.

source: བྱང་ཆུབ་ཀྱི་ལམ་མ་འོངས་པའི་སྐྱེ་བ་དང་། རྒ་བ་དང་འཆི་བའི་སྡུག་བསྔལ་འབྱུང་བ་ནུབ་པར་བྱེད་པ་གཞན་ཞིག་ཡོད་དོ་སྙམ་མོ།
en: But there must be another path to awakening that can eradicate the future suffering of birth, old age, and death.”

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། ངས་ཕའི་སྐྱེད་མོས་ཚལ་དུ་ཤིང་འཛམ་བུའི་གྲིབ་མ་ལ་འདུག་སྟེ། འདོད་པ་རྣམས་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་ནས་བསམ་གཏན་བཞི་པའི་བར་དུ་བསྒྲུབས་ཏེ་གནས་པ་དེ་བྱང་ཆུབ་ཀྱི་ལམ་ཡིན་ཏེ་སྐྱེ་བ་དང་། རྒ་བ་དང་ན་བ་དང་འཆི་བའི་སྡུག་བསྔལ་འབྱུང་བ་རྣམས་ནུབ་པར་འགྱུར་བ་ཡིན་སྙམ་ནས། དེ་བྱང་ཆུབ་ཀྱི་ལམ་ཡིན་ནོ་སྙམ་སྟེ། ངའི་རྣམ་པར་ཤེས་པ་དེའི་རྗེས་སུ་འབྲང་བར་གྱུར་ཏོ། །ངས་འདི་སྙམ་དུ་བསམས་ཏེ། འདི་ལྟར་ཉམ་ཆུང་བར་གྱུར་པས་ནི་ལམ་དེ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་མི་ནུས་སོ།
en: Monks, I continued to think, “Once, when I was sitting in my father’s park under the shade of a rose apple tree, I rejoiced as I attained the first level of concentration, which is free from desires and negativities, endued with good qualities, reflective, investigative, and full of joy born out of discrimination. I rejoiced as I attained the levels of concentration up to the fourth. That, indeed, must be the path to awakening, which can eradicate the arising of the sufferings of birth, old age, sickness, and death. And so a conviction was born in me: ‘This is the path to awakening!’ ” Again I thought, “Yet this path cannot be realized by someone who has grown so weak.

source: །གལ་ཏེ་ང་འདི་ལྟར་ལུས་ངན་ཅིང་ཉམ་ཆུང་བཞིན་དུ་མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་ན་ནི་ངས་ཕྱི་མའི་སྐྱེ་བོ་ལ་སྙིང་བརྩེ་བ་བྱས་པར་མི་འགྱུར་ཏེ།
en: If I were to proceed toward the seat of awakening merely by the power of my supernatural knowledge but with my body so critically weak, future beings would not be disposed favorably toward me, and this path would not lead to awakening.

source: འདི་ཡང་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་གྱིས། ངས་ཁ་ཟས་རགས་པ་ཟོས་ལ་ལུས་ཀྱི་མཐུ་སྟོབས་བསྐྱེད་དེ། དེ་ནས་གདོད་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོའོ་སྙམ་མོ།
en: Therefore I shall begin to eat solid food again. That way I can regain my physical strength. Once I do so, I will proceed to the seat of awakening.”

source: །དགེ་སློང་དག་དེ་ན་ལྷའི་བུ་གང་དག་ང་ལ་མོས་པ་དེ་དག་གིས་ངའི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཤེས་ནས། ང་ག་ལ་བ་དེར་འོངས་ཏེ་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Monks, at that point some gods felt concern for me. Since they knew my thoughts, they came to where I was staying and told me,

source: །སྐྱེས་བུ་དམ་པ་ཞལ་ཟས་རགས་པ་མ་གསོལ་ཅིག །བདག་ཅག་གིས་བ་སྤུའི་ཁུང་བུར་མདངས་སྩལ་བར་བགྱིའོ།
en: “Holy Man, don’t eat solid food! We can give you nourishment through the pores of your body.”

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་ནི་ཟས་མི་བཟའ་བར་བདག་ཉིད་ཀྱིས་དམ་བཅས་ལ།
en: Monks, I then thought, “I took a vow to remain fasting.

source: བདག་གི་སྤྱོད་ཡུལ་གྱི་གྲོང་ན་གནས་པའི་སྐྱེ་བོ་ཉེན་ཀོར་བ་རྣམས་ཀྱིས་ཀྱང་། འདི་ལྟར་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་ཟས་མི་ཟ་བ་ཡིན་པར་ཡང་ཤེས་ཏེ།
en: And in this way the people in the villages around me would know that the mendicant Gautama abstains from food.

source: ང་ལ་མོས་པའི་ལྷའི་བུ་འདི་དག་གིས་ངའི་བ་སྤུའི་ཁུང་བུར་མདངས་བཅུག་པར་གྱུར་ན། ངས་ཤིན་ཏུ་བརྫུན་སྨྲས་པར་གྱུར་ཏོ་སྙམ་སྟེ།
en: However, if these concerned gods were to grant me nourishment through the pores of my body, I would be the worst of hypocrites.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བརྫུན་སྨྲ་བ་སྤང་བའི་ཕྱིར་ལྷའི་བུ་དེ་དག་གི་ཚིག་མ་མཉན་པར་ཁ་ཟས་རགས་པ་བཟའ་བར་སེམས་བཏུད་དོ།
en: The Bodhisattva therefore decided to disregard the words of the gods in order to avoid hypocrisy. Instead he decided to begin eating solid foods.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ལོ་དྲུག་གི་བར་དུ་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་ཉམས་སུ་བླངས་ནས། སྟན་དེ་ལས་ལངས་ཏེ། ཁ་ཟས་རགས་པ་འདི་ལྟ་སྟེ་བུ་རམ་གྱི་དབུ་བ་དང་། མོན་སྲན་སྡེའུ་ཡི་ཁུ་བཅུད་དང་། ཧ་རེ་ནུ་ཁའི་ཁུ་བཅུད་དང་། ཟན་དང་། འབྲས་ཆན་དང་། འདྲེན་མར་བཟའོ་ཞེས་ཚིག་ཏུ་བརྗོད་དོ།
en: Monks, in this way the Bodhisattva arose from the seat where he had practiced discipline and hardship for the past six years, and he proclaimed, “I will now eat solid foods, such as molasses, pea soup, lentil soup, porridge, and rice!”

source: །དགེ་སློང་དག་དེ་ནས་ལྔ་སྡེ་བཟང་པོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། དགེ་སྦྱོང་གཽ་ཏ་མས་ལམ་འདི་དང་བསྒྲུབ་པ་འདིས་མིའི་ཆོས་བླ་མ་ལས་མཆོག་ཏུ་གྱུར་པ་འཕགས་པ་ཡེ་ཤེས་མཐོང་བའི་ཁྱད་པར་གང་ཡང་མངོན་དུ་བྱེད་མ་ནུས་ན་ཁ་ཟས་རགས་པ་འདི་ཟོས་ཏེ། བསོད་ཉམས་ལ་སྦྱོར་བ་དང་ལྡན་པར་གནས་པས་ཅི་ནུས་ཏེ་མི་གསལ་བ་བྱིས་པ་ཡིན་ནོ་སྙམ་དུ་བསམས་ནས་བྱང་ཆུབ་སེམས་དཔའི་གན་ནས་སོང་སྟེ།
en: Monks, at that point the five ascetic companions thought to themselves, “Based on this path and these practices, the mendicant Gautama appears unable to actualize an exalted wisdom vision that is any higher than manmade teachings. Yet how can eating solid foods and leading a comfortable life be of any help? What an ignorant and childish man!”

source: གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱིར་སོང་ནས་དྲང་སྲོང་ལྷུང་བ་རི་དགས་ཀྱི་ནགས་སུ་གནས་སོ།
en: With this thought in mind, the companions left the Bodhisattva and headed toward Vārāṇasī, where they set up camp at the Deer Park by the Hill of the Fallen Sages.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐོག་མ་ཉིད་དུ་དཀའ་བ་སྤྱད་པ་སྤྱོད་པ་ན་གྲོང་པའི་བུ་མོ་གཞོན་ནུ་བཅུས་བལྟ་བ་དང་ཕྱག་བྱ་བའི་ཕྱིར་བསྙེན་བཀུར་བྱས་སོ།
en: Ever since the Bodhisattva had begun his practice of austerities, ten young girls from the village had served him as a way to see him, venerate him, and assist him.

source: །ལྔ་སྡེ་བཟང་པོ་དེ་དག་གིས་ཀྱང་རིམ་གྲོ་བྱས་ཤིང་རྒྱ་ཤུག་འབྲུ་གཅིག་དང་། འབྲས་འབྲུ་གཅིག་དང་། ཏིལ་འབྲུ་གཅིག་དབུལ་བ་ཡང་ཕུལ་ལོ།
en: At the same time his five companions had also attended him by bringing him the single juniper berry, sesame seed, or rice grain that he ate.

source: །གྲོང་པའི་བུ་མོ་བཅུ་ནི་བུ་མོ་སྟོབས་ལྡན་མ་ཞེས་བྱ་བ་དང་། སྟོབས་སྦེད་མ་དང་། ཤིན་ཏུ་སྡུག་དང་། སྡེ་ལས་རྣམ་པར་རྒྱལ་དང་། ཨ་ཏི་མུག་ཏ་ཀའི་ཕྲེང་བ་ཅན་དང་། མཛེས་མ་དང་། རྫ་བྱེད་མ་དང་། སྐྲ་ལྕང་ལོ་རྒྱས་དང་། རལ་བུ་ཅན་དང་། ལེགས་སྐྱེས་མ་ཞེས་བྱ་བ་སྟེ།
en: The names of these ten village girls were Balī, Balaguptā, Supriyā, Vijayasenā, Atimuktaka­malā, Sundarī, Kumbhakārī, Uluvillikā, Jāṭilikā, and Sujātā.

source: གཞོན་ནུ་མ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོད་མའི་རྣམ་པ་དེ་དག་ཐམས་ཅད་བྱས་ཏེ་ཕུལ་ལོ།
en: These young girls now prepared various types of soups for the Bodhisattva and offered them to him.

source: །བྱང་ཆུབ་སེམས་དཔས་ཀྱང་དེ་དག་ཟོས་ནས་རིམ་གྱིས་སྤྱོད་ཡུལ་གྱི་གྲོང་དུ་བསོད་སྙོམས་སྤྱད་པས་མདོག་དང་། གཟུགས་དང་། སྟོབས་དང་ལྡན་པར་གྱུར་ཏོ།
en: The Bodhisattva accepted these meals, but he also gradually began to go on alms rounds in the local village. In this way he regained his previous luster, appearance, and strength.

source: །དེ་ཚུན་ཆད་བྱང་ཆུབ་སེམས་དཔའ་ལ་དགེ་སྦྱོང་མཛེས་པ། དགེ་སྦྱོང་ཆེན་པོ་ཞེས་འཛེར་ཏོ།
en: People now began calling him “the beautiful monk” and “the great monk.”

source: །དགེ་སློང་དག་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དང་པོ་ཉིད་དུ་དཀའ་བ་སྤྱད་པ་སྤྱོད་པ་ན་བྱང་ཆུབ་སེམས་དཔས་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱ་བ་དང་། ལུས་རྟས་པར་བྱ་བའི་ཕྱིར་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མས་ཉིན་གཅིག་བཞིན་དུ།
en: Monks, every day since the beginning of the Bodhisattva’s practice of austerities, the village girl Sujātā had offered food to eight hundred priests in the hope that the Bodhisattva would come out of his discipline and hardship and maintain his vital functions.

source: བྲམ་ཟེ་བརྒྱད་བརྒྱ་ཟན་བྱིན་ཞིང་འདི་སྐད་དུ་བདག་གི་ཟས་ཟོས་པས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་ཡང་བཏབ་བོ།
en: As she did so, she offered the prayer, “May the Bodhisattva take my food and thereby truly attain perfect and completely unexcelled awakening!”

source: །དགེ་སློང་དག་ལོ་དྲུག་འདས་ནས། ངས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: Monks, since six years had passed, I had this thought, “My saffron robes have really aged.

source: གལ་ཏེ་བདག་གིས་འདོམས་ཡོག་འགའ་ཞིག་རྙེད་ན་རེ་སྟེས་སྙམ་མོ། །དགེ་སློང་དག་དེའི་ཚེ་གྲོང་པའི་བུ་མོ་ལེགས་སྐྱེས་མའི་བྲན་མོ་གྲུབ་མ་ཞེས་བྱ་བ་ཞིག་ཤི་ནས་དེ་ཤ་ནའི་རས་ཀྱིས་དཀྲིས་ཏེ།
en: Perhaps it would be good if I could find some cloth to cover me.” Monks, at that point one of Sujātā’s servants, a woman named Rādhā, had just died. She had been wrapped in a hemp cloth and left in the charnel ground.

source: དུར་ཁྲོད་དུ་བོར་བར་གྱུར་པའི་ཕྱག་དར་ཁྲོད་པ་དེ་ངས་མཐོང་ནས།
en: When I saw this dusty rag, I decided to use it to cover myself.

source: ངས་ཕྱག་དར་ཁྲོད་པ་དེ་བླང་བའི་ཕྱིར་རྐང་པ་གཡོན་པས་མནན་ཏེ། དགུས་ནས་ལག་པ་གཡས་པ་བརྐྱང་པ་དང་། དེ་ནས་ས་བླའི་ལྷས་བར་སྣང་གི་ལྷ་རྣམས་ལ་སྒྲ་བསྒྲགས་པ།
en: As I stood there, bent over with my left leg stretched out and my right hand reaching down in order to pick up the rag, one earth god called out to the sky gods,

source: གྲོགས་པོ་དག་འདི་ལྟར་རྒྱལ་པོ་ཆེན་པོའི་རིགས་སུ་སྐྱེས་པ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་བོར་ཏེ། ཕྱག་དར་ཁྲོད་པ་ལ་སེམས་བཏུད་པ་ངོ་མཚར་ཏེ། གྲོགས་པོ་དག་འདི་ནི་རྨད་དུ་བྱུང་བའོ།
en: “Friends, here is a descendent of a great royal clan. He has abandoned his kingdom of a universal monarch, and now he turns his mind to a dusty rag. What a sight! Friends, this is really amazing!”

source: །བར་སྣང་གི་ལྷ་རྣམས་ཀྱིས་ས་བླའི་ལྷ་རྣམས་ཀྱི་སྒྲ་ཐོས་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ལ་སྒྲ་བསྒྲགས་སོ། །རྒྱལ་ཆེན་བཞིའི་རིས་པས་ཀྱང་སུམ་ཅུ་རྩ་གསུམ་པ་ལའོ།
en: All the sky gods heard the voice of the earth god, and they passed on the message to the gods in the Heaven of the Four Great Kings. The gods in the Heaven of the Four Great Kings told the gods in the Heaven of the Thirty-Three.

source: །སུམ་ཅུ་རྩ་གསུམ་པས་ཀྱང་འཐབ་བྲལ་བ་ལའོ། །འཐབ་བྲལ་བས་ཀྱང་དགའ་ལྡན་པ་ལའོ། །དགའ་ལྡན་པས་ཀྱང་འཕྲུལ་དགའ་བ་ལའོ། །འཕྲུལ་དགའ་བས་ཀྱང་གཞན་འཕྲུལ་དབང་བྱེད་པ་ལའོ། །གཞན་འཕྲུལ་དབང་བྱེད་པས་ཀྱང་ཚངས་རིས་པའི་བར་དུའོ། །
en: They in turn passed on the message to the gods in the Heaven Free from Strife, and from there the message spread to the Heaven of Joy, the Heaven of Delighting in Emanations, the Heaven of Making Use of Others’ Emanations, and finally all the way to the Brahma realm.

source: སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་གྲོགས་པོ་དག་འདི་ལྟར་རྒྱལ་པོ་ཆེན་པོའི་རིགས་སུ་སྐྱེས་པ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་སྲིད་བོར་ཏེ། ཕྱག་དར་ཁྲོད་པ་ལ་སེམས་བཏུད་པ་ངོ་མཚར་ཏེ། འདི་ནི་རྨད་དུ་བྱུང་བའོ་ཞེས་སྒྲ་གཅིག་དང་། བརྗོད་པ་གཅིག་འོག་མིན་གྱི་གནས་ཀྱི་བར་དུ་གྲགས་པར་གྱུར་ཏོ།
en: Monks, at that time, at that moment, at that very instant, this message resounded and traveled all the way to Highest Heaven: “Friends, here is a descendent of a great royal clan. He has abandoned his kingdom of a universal monarch, and now he turns his mind to a dusty rag. What a sight! Friends, this is really amazing!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཡང་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་ཕྱག་དར་ཁྲོད་པ་ནི་རྙེད་ན། གལ་ཏེ་ཆུ་ཞིག་རྙེད་ན་རེ་སྟེས་སྙམ་མོ། །དེ་ནས་དེ་ཉིད་དུ་ལྷས་ལག་པ་ས་ལ་བརྡབས་པ་དང་། དེར་རྫིང་བུ་ཞིག་བྱུང་བར་གྱུར་ཏེ། དེང་སང་དུའང་ལག་པ་བརྡབས་པའི་རྫིང་ཞེས་གྲགས་སོ།
en: The Bodhisattva then thought to himself, “I have found this dusty rag, so it would be good if I could find some water to wash it with.” At that very moment the gods hit the ground with their hands, and on that spot a lotus pond appeared. Still to this day, this pond is known as “The Pond Where the Hands Struck.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་ཆུ་ནི་རྙེད་ན། གལ་ཏེ་ཕྱག་དར་ཁྲོད་པ་འདི་བཀྲུ་བའི་རྡོ་ལེབ་ཅིག་རྙེད་ན་རེ་སྟེས་སྙམ་པ་དང་། སྐད་ཅིག་དེ་ཉིད་ལ་བརྒྱ་བྱིན་གྱིས་དེར་རྡོ་ལེབ་བཞག་ནས། དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་ཕྱག་དར་ཁྲོད་པ་དེ་བཀྲུས་སོ།
en: Once again the Bodhisattva thought, “Now I have obtained water, so it would be good if I could also find a flat stone on which to wash this cloth.” At that very moment Śakra placed such a rock before him, and the Bodhisattva now began to wash the dusty rag.

source: །དེ་ནས་ལྷའི་རྒྱལ་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Śakra, king of the gods, then spoke to the Bodhisattva:
